Revit 2027 API
FailureMessage.HasResolutionOfType Method
 Checks if failure has a resolution of a given type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasResolutionOfType(
	FailureResolutionType type
)
Public Function HasResolutionOfType (
	type As FailureResolutionType
) As Boolean
public:
bool HasResolutionOfType(
	FailureResolutionType type
)
member HasResolutionOfType :
        type : FailureResolutionType -> bool
Parameters
type FailureResolutionType
 The type of resolution.
Return Value
Boolean
 True if the failure has a type of resolutions, else false.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
FailureMessage Class
Autodesk.Revit.DB Namespace